const module = {
    id: 1,
    title: ' Основы React: JSX, компоненты, передача данных',
    description:
        'Познакомимся с основами React — одной из самых популярных библиотек для разработки пользовательских интерфейсов. Узнаем о синтаксическом расширении JavaScript — JSX, компонентах и передаче данных в компоненты. Создадим первое приложение на React.',
    difficulty: 1,
    progress: 40,
    step: [
        {
            id: 1,
            title: 'Базовые структуры данных',
            description:
                'Разберём базовые структуры данных и алгоритмы для их обработки. Научимся работать с массивами, функциями и объектами. Напишем программы для расшифровки сообщений, несколько калькуляторов для коммерческих и бухгалтерских расчётов, конструктор компьютера из комплектующих.',
            tasks: [
                {
                    id: 1,
                    title: 'Массивы',
                    description:
                        'Массивы. Доступ к элементам массива по индексу. Вычисление медианы и среднего. Алгоритм сортировки.',
                    type: 'theory',
                },
                {
                    id: 2,
                    title: 'Графы',
                    description:
                        'Массивы. Доступ к элементам массива по индексу. Вычисление медианы и среднего. Алгоритм сортировки.',
                    type: 'code',
                },
                {
                    id: 3,
                    title: 'Сортировка',
                    description:
                        'Массивы. Доступ к элементам массива по индексу. Вычисление медианы и среднего. Алгоритм сортировки.',
                    type: 'test',
                },
                {
                    id: 4,
                    title: 'Сортировка',
                    description:
                        'Массивы. Доступ к элементам массива по индексу. Вычисление медианы и среднего. Алгоритм сортировки.',
                    type: 'exam',
                },
            ],
        },
        {
            id: 2,
            title: 'Погружение в браузерный JavaScript',
            description:
                'Разберём базовые структуры данных и алгоритмы для их обработки. Научимся работать с массивами, функциями и объектами. Напишем программы для расшифровки сообщений, несколько калькуляторов для коммерческих и бухгалтерских расчётов, конструктор компьютера из комплектующих.',
            tasks: [
                {
                    id: 1,
                    title: 'Массивы',
                    description:
                        'Массивы. Доступ к элементам массива по индексу. Вычисление медианы и среднего. Алгоритм сортировки.',
                    type: 'theory',
                },
                {
                    id: 2,
                    title: 'Графы',
                    description:
                        'Массивы. Доступ к элементам массива по индексу. Вычисление медианы и среднего. Алгоритм сортировки.',
                    type: 'code',
                },
            ],
        },
        ,
    ],
};

const ModulePage = () => {
    return (
        <section className='module container'>
            <div className='module__wrapper content-wrapper'>
                <div className='content-wrapper'>
                    <h2 className='module__head'>{module.title}</h2>
                </div>
                <section className='content-wrapper'>
                    <h3>Программа</h3>
                    <ul className='module__steps-list' />
                </section>
            </div>
        </section>
    );
};

export default ModulePage;
